{
    "news_1": {
        "title": "[PS4] Duck Hunt Remake VR disponible",
        "content": "Le développeur Lapy propose un tout nouvel homebrew à destination de la PlayStation 4 et PlayStation 4 Pro, à condition de disposer d'un kit PSVR car c'est un jeu VR qui est dévoilé, Duck Hunt Remake avait lui était proposé par Lapy il y a presque 4 ans.  \n \nC'est Duck Hunt Remake VR qui a été mis en ligne, il tient à remercier LightningMods pour avoir documenté l'homebrew, il remercie également VitaHex pour lui avoir indiqué où trouver de très bons modèles 3D, et également megadjx13, un ami qui lui a offert son kit PSVR. \n \n \n\n \n \nBien entendu pour en profiter il faut disposer d'un contrôleur PSMove.\n \n \nTéléchargement : Duck Hunt Remake VR\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172113/in-ps4-duck-hunt-remake-vr-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] OkageLibrary Mobile 1.0 disponible",
        "content": "Le développeur SvenGDK propose un petit utilitaire qui permet d'envoyer des ELFs et donc de charger des fichiers ISO sur PS4 et PS5 via l'exploit mast1c0re le tout sur un téléphone ou une tablette Android. \n \nIl s'agit là d'une version mobile de OkageLibrary. \n \n \n\n \n \nFonctionnalités de la version 1.0 :\n \n- Envoi d'ELF avec le loader d'ELF en version réseau de mast1c0re\n- Envoi de jeux PS2 au Network Game Loader de mast1c0re\n- Permet d'envoyer les fichiers de configuration \"GAME-ID_cli.conf\" après le transfert d'un jeu (nécessite la dernière version de Network Game Loader)\n- Gestionnaire de sauvegarde PS2\n- Affiche le titre et la couverture du jeu à partir de PSXDatacenter si l'ID du jeu est pris en charge\n \n \nTéléchargement : OkageLibrary Mobile 1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172089/in-ps4ps5-okagelibrary-mobile-10-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS3] Apollo Save Tool 1.8.4 disponible",
        "content": "Le développeur Bucanero repart aux sources en proposant une nouvelle version d'Apollo Save Tool pour la PlayStation 3, il vient en effet de mettre à jour son superbe gestionnaire de sauvegardes qui devrait être livré par défaut avec toutes les consoles Sony tellement il est efficace et simple d'utilisation. Ce serait vraiment dommage de se priver de son utilisation si vous disposez d'une console récente Sony. \n \nCette nouvelle version 1.8.4, qui est dédiée à Luna et Leon, apporte pas mal de nouveautés dans l'éditeur hexadécimal, corrige quelques bugs sur certains jeux comme Final Fantasy XIII ou Dai-3-Ji Super Robot Taisen Z, et a mis à jour certains moteurs de vérifications. \n \n \n \n\n \n \nChangelog 1.8.4 : \n \nAjouts\n- Éditeur hexadécimal pour les fichiers de sauvegarde\n- Amélioration du serveur Web interne (prise en charge de la base de données en ligne)\n- Activation personnalisée de l'ID de compte hors ligne (clavier à l'écran)\n- URL de la base de données en ligne définie par l'utilisateur (paramètres)\nCorrections\n- Correction d'un bug de décryptage des sauvegardes de Final Fantasy XIII\nDivers\n- Mise à jour du moteur de patch Apollo v0.4.1\n- Passer la recherche si le motif n'a pas été trouvé\n- Amélioration des types de code 9, B, D\n- Correction du bug de cryptage de Final Fantasy XIII sur PS3\n- Prise en charge de la soustraction de valeur (BSD)\n- Contrôle personnalisée sur Dai-3-Ji Super Robot Taisen Z\n \n \nTéléchargement : Apollo Save Tool 1.8.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172085/in-ps3-apollo-save-tool-184-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] Goldleaf 0.10.1 disponible",
        "content": "Le développeur XorTroll fait son retour sur la scène Switch en proposant une nouvelle version de Goldleaf.\n \nRappelons que Goldleaf, l'équivalent de FBI pour Nintendo Switch, revient avec une nouvelle version qui corrige quelques bugs et apporte le support des derniers firmwares 16.0.0 et 16.0.1. \n \nComme vous le savez Goldleaf est un concurrent à Tinfoil, l'application comprend plusieurs utilitaires, tels que la navigation NAND / SD, l'installation de fichiers NSP et la gestion du contenu ou des tickets.\n \n \n \n \n\n \nChangelog 0.10.1 : \n \n- Mise à jour avec la dernière version de libnx, supportant correctement les firmwares jusqu'à 16.0.1\nGoldleaf \n- Correction d'un bug où l'emplacement de plusieurs installations de NSP était incorrectement sélectionné.\n- La navigation dans le menu de contenu a été améliorée (quitter ne revient pas soudainement au menu principal, etc.)\n- Ajout de la prise en charge du chinois traditionnel\n- Mise à jour des informations sur la génération des clés (pour les dernières versions du système)\n- Les options du menu de contenu sont maintenant correctement définies : le contenu des cartes de jeu a maintenant des options correctes, et d'autres corrections/améliorations dans le code des options.\n- Le dumping est maintenant appelé export, et le contenu exporté va maintenant dans /export au lieu de /dump.\n- Ajout d'un menu pour les paramètres propres à Goldleaf, qui ne permet pour l'instant que de sélectionner la langue personnalisée et d'ignorer les versions de firmware requises lors de l'installation de contenus.\n- Le dumping d'amiibo a été amélioré, permettant maintenant de dumper la zone d'application de l'amiibo (données sauvegardées du jeu) si elle existe, et son mii dans l'ancien format 3DS.\n- Refonte du menu des tickets (tous les tickets, même ceux utilisés, sont désormais affichés), ajout de la possibilité de les exporter.\n- Correction d'un problème où l'annulation de la saisie d'une URL lors de la consultation d'une page web tentait d'ouvrir quand même le navigateur web.\n- Ajout de la prise en charge des icônes spécifiques à une langue dans les installations NSP, de sorte que Goldleaf tente désormais de trouver et d'afficher l'icône correspondant à la langue de Goldleaf (qui est par défaut la langue du système).\n- Correction des valeurs invalides/insensées de \"jeu joué depuis\".\n- A partir de maintenant, Quack et Goldleaf suivront la même numérotation de version : ce sera donc moins confus à partir de maintenant, par conséquent, Quark passe de 0.5 à 0.10.1 dans cette version.\n \n \nTéléchargement : Goldleaf 0.10.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172084/in-switch-goldleaf-0101-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[3DS/Switch] PKHeX du 06 Avril 2023 disponible",
        "content": "Les développeurs de PKHeX viennent de mettre en ligne une nouvelle version de leur outil à destination de la Nintendo 3DS, Switch, et Gamecube. \n \nComme vous le savez avec lui les utilisateurs peuvent manipuler divers fichiers de sauvegarde, y compris : .sav,.dsv,.dat,.gci,.raw et.bin. PKHeX peut également lire et écrire les fichiers.pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \n \n\n \nChangelog : \n \n- Modifié : Les régions Vivillon 3DS fonctionnent. Merci @abcboy101 !\n- Corrigé : Les vérifications BDSP sont correctes\n- Corrigé : Les captures de parcours de Pokéwalker Gen4 sont maintenant autorisées pour toutes les versions.\n- Ajouté : L'éditeur PKM affiche maintenant le type d'élément pour les déplacements.\n- Ajouté : PKM Editor montre maintenant le ruban apposé (ou si un ruban peut être apposé) sur l'onglet cosmétique.\n- Ajouté : Cliquez sur l'indicateur de ruban apposé pour ouvrir l'éditeur de ruban (comme le bouton).\n- Ajouté : Cliquez sur un sprite de ruban dans l'éditeur de ruban pour l'apposer rapidement.\n- Ajouté : La date d'inscription au SV peut maintenant être changée via l'éditeur de blocs. Merci @foohyfooh !\n- Ajouté : Plus de fonctionnalités Gen3 Mystery Gift API ajoutées. Merci @Bl4ckSh4rk !\n- Corrigé : L'importation de Cadeaux Mystères dans le 11ème emplacement de la liste de Cadeaux Mystères de l'interface graphique du fichier de sauvegarde fonctionne maintenant comme prévu.\n- Corrigé : L'Œuf de Manaphy Gen4 est maintenant généré correctement à partir de la base de données des rencontres.\n- Corrigé : Gen4/5 Country/Region ne génère plus d'erreur pour certains pays.\n- Corrigé : Les statistiques de la Gen1/2 se calculent maintenant correctement (EVs à racine carrée parfaite).\n- Modifié : Mise à jour de la manipulation pour générer et vérifier correctement la taille des entités WC9.\n- Modifié : Plus d'améliorations de performance réduisant les allocations.\n \n \nTéléchargement : PKHeX 23.04.06\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-909709169.png"
        }
    },
    "news_6": {
        "title": "[Gamecube] Installer un SSD dans sa console sera bientôt possible",
        "content": "Il aura finalement fallu que le cube préféré des gamers atteigne sa vingtaine pour connaître un très fort regain d'intérêt dans le monde du hacking. Ces trois dernières années ont en effet été très prolifiques en matière de hack sur la Nintendo Gamecube : PicoBoot, SD2SP2, PlutoGC HDMI, KunaiGC, MemCard Pro GC, BlueRetro, sans compter les mises à jour très fréquentes de Swiss, l'outil indispensable pour tout hacker Gamecube.\n \nCette période hautement productive semble également stimuler considérablement la créativité des hackers. En effet, ils ne se limitent pas à optimiser les réalisations existantes, mais recherchent constamment de nouvelles approches pour moderniser la console et résoudre des problèmes récurrents. A ce titre, la question du stockage et des vitesses de transfert demeure toujours d'actualité : même avec les configurations actuelles, il est impossible d'atteindre des performances équivalentes à celles d'un disque de jeu lorsqu'on charge une copie de sauvegarde depuis une carte mémoire (via le lecteur de cartes mémoire ou un SD2SP2). Le hacker WebHDX, connu pour être à l'origine du PicoBoot, mais aussi du WiiMini-SDRST, s'est attardé sur ce sujet et a élaboré une nouvelle solution baptisée M.2 Loader. \n \n\n \nCe kit à installer dans le port série 1 (SP1), permet de connecter un SSD au format M.2 (non NVMe) à votre console, afin d'y lire vos copies de sauvegardes de jeux Gamecube sous tous les formats supportés par Swiss. Le célèbre logiciel supportera nativement le M.2 Loader, grâce à un travail collaboratif entre WebHDX et emukidid.\n \nSur le plan technique, il est intéressant de noter que les ports de carte mémoire Gamecube, le port SP1 et le port SP2 sont tous gérés par le même bus (qui permet le transfert des données), à savoir le \"Exi Bus\". Pour autant, si les SD2SP2 et SD Gecko ne font que transférer leurs données directement à ce bus, le M.2 Loader est bien mieux pensé, exploitant une puce (de type CPLD, donc programmable) pour opérer au transfert des données jusqu'à la console. Cela permet donc un meilleur traitement et une meilleur optimisation dans les transferts, ce qui résulte en des performances accrues. Lorsque le M.2 Loader sera produit pour le grand public, il est prévu que cette puce soit celle du Raspberry Pi Pico (encore lui !), certainement pour son accessibilité et son coût faible. \n \nLe youtubeur Macho Nacho a eu la possibilité de tester le M.2 Loader en exclusivité. Une vidéo de présentation détaillée et d'installation est d'ores et déjà disponible sur sa chaîne. \n \nhttps://youtu.be/1uxu8anymDg\n \nAffaire à suivre ! ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172034/in-gamecube-installer-un-ssd-dans-sa-console-sera-bientot-possible-1.jpg"
        }
    },
    "news_7": {
        "title": "[XBS/XBX/XBO] Microsoft bloque les émulateurs en Retail",
        "content": "Triste nouvelle que l' on apprend aujourd'hui, Microsoft vient en effet de déclarer vouloir combattre les applications non officiel en mode retail, ce qui implique donc les émulateurs et autre homebrew disponible depuis un petit moment sur nos Xbox One et Séries.\n \n\n \nSuite à cette déclaration, le simple fait de se connecter au Xbox Live, toutes les applications non officielles installés en mode retail vous donneront maintenant une erreur 0x87e1002d, comme vous pouvez le voir ci dessous, le message est clair.\n \n\n\n\n\"0x87e1002d \nThis game or app can't be launched as it violates the Microsoft Store Policy.\"\n \n\n\n\n \nMalgré cette mauvaise nouvelle, il vous sera toujours possible de lancer des émus sur vos Xbox:\n \n- Soit en mode dev, ce qui implique bien sur de posséder un compte développeur afin de switcher dans ce mode pour exécuter vos homebrews et émulateurs.\n \n- Soit d' utiliser les sites d'hébergement online d' émulateurs comme je vous l' informait il y a peu avec cette news: https://xbox-360.logic-sunrise.com/news-1166940-xbsxbxxbo-emulateurs-sans-dev-mode-ni-installation-ni-ftp.html\n \nPetite note personnelle,comme me l'a fait remarquer mon grand ami Hyndrid, l' arrivé de Xenia sur Xbox doit y est grandement pour quelque chose, pouvoir lancer des isos XBOX 360 depuis le mode retail n' a pas du plaire à Microsoft, qui avant çela n'était pas déranger sur  le fait que l' on puisse lancer des émulateurs D AUTRES CONSTRTUCTEURS sur leur console.\n \nBref de ce fait, les Xbox One et Séries perdent un atouts majeur face à leur concurrentes, même si je le rappelle il est toujours possible de lancer nos homebrews en dev mod.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-452068714.png"
        }
    },
    "news_8": {
        "title": "[Switch] Hekate v6.0.3 et Nyx v1.5.3 disponibles",
        "content": "Le développeur CTCaer vient de mettre en ligne il y a quelques minutes une nouvelle version de Hekate qui est désormais proposé en version 6.0.3 et Nyx passe lui en version 1.5.3.\n \n \nCette version étant une intermédiaire, les changements ne sont pas très nombreux, mais ils sont là, notamment pour corriger des bugs ou des blocages. \n \n \n\n \n \nModifications dans hekate v6.0.3 : \n \n- Une substitution a été ajoutée pour les mauvais chainloaders qui laissent les gpios sd dans un mauvais état.\n- L4T : Certaines puces Samsung T210B01 2019 peuvent maintenant être overclockées à 2133 MHz pour Linux/Android.\n- L4T : Ajout d'un changement obligatoire pour supporter la vitesse du bus SD UHS DDR200 pour Linux/Android.\n- Correction d'un cas particulier où si hekate était exécuté et que l'alarme rtc était déclenchée après, le démarrage à HOS éteignait l'appareil. Puisque dans ce cas la Switch a été réveillé par l'alimentation ou l'USB, tous les flags sont maintenant effacés lors des vérifications de la mise hors tension automatique du HOS.\n- Diverses corrections et améliorations\n \nChangements Nyx v1.5.3 :\n \n- Le benchmark des cartes SD/eMMC se bloque désormais moins entre chaque lecture, afin de solliciter davantage les cartes.\n- Diverses corrections et améliorations\n \nChangements BDK :\n \n- GPIO : Réorganisation de la configuration des fonctions d'entrée/sortie afin d'atténuer les mauvaises configurations des chargeurs précédents.\n- GPIO : Ajout d'une fonction dobounce set\n- SDMMC : Ajout d'un mode de vitesse de bus SD UHS DDR200, capable d'atteindre 200MB/s sur le bus UHS-I. Peut être activé avec le drapeau BDK_SDMMC_UHS_DDR200_SUPPORT au moment de la construction.\n- SDMMC : Ajout d'un mode de vitesse de bus SD DDR50 approprié. Non utilisé par défaut.\n- SDMMC : Correction de l'ordre de réglage de la limite de puissance SD. Par spécification, cela n'a d'importance que pour les SDR50 et plus.\n- SDMMC : Correction d'un problème avec la détection du retrait des cartes SD.\n- SDDMC : Ajout de la prise en charge de l'ensemble des types de pilotes sdmmc.\n- SDMMC : Ajout de fonctions d'impression de débogage de tous les registres de la carte SD (CID/CSD/SCR/SSR).\n- SDRAM : Ajout d'une fonction qui permet à la tolérance de latence pour SDMMC1 d'être patchée sur les valeurs eMMC.\n- INPUT : Réorganisation de la mise sous tension de l'écran tactile afin d'induire une petite réinitialisation au démarrage.\n- UTILS : Suppression de l'alarme stop rtc des fonctions de gestion de l'énergie\n \n \nTéléchargement : Hekate v6.0.3 et Nyx v1.5.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171946/in-switch-hekate-v603-et-nyx-v153-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] De nouvelles vulnérabilités découvertes dans les APU Ryzen",
        "content": "De nouvelles vulnérabilités ont été découvertes dans les APU AMD Ryzen, l'information est rapportée par Wololo.net, des failles qui pourraient être utilisées par certains développeurs pour parvenir à casser les sécurités de son processeur sécurisé (SP) ou son unité de gestion système (SMU).\n \n \n\n \n \nLes deux vulnérabilités dont Zecoxao se fait écho ont été qualifiées comme bénéficiant d'une gravité élevée, c'est à dire qu'en parvenant à les lancer, on aboutirait sur l'accès à des privilèges élevés.\n \n \nCVE-2023-20558 (gravité : élevée)\n \nUne gestion insuffisante du flux de contrôle dans AmdCpmOemSmm peut permettre à un attaquant privilégié de falsifier le gestionnaire SMM, ce qui pourrait entraîner une élévation des privilèges.\n \nCVE-2023-20559 (gravité : élevée)\n \nUne gestion insuffisante du flux de contrôle dans AmdCpmGpioInitSmm peut permettre à un attaquant privilégié de falsifier le gestionnaire SMM, ce qui pourrait entraîner une élévation des privilèges.\n \n \nCes vulnérabilités 2023 sont reportées par AMD dans un bulletin de sécurité spécifique ici.\n \nC'est une obligation de communication pour le fondeur qui permet d'avertir les utilisateurs que leur matériel intègre des failles, et que les bios doivent être mis à jour pour colmater ces brèches. Cependant si la PS5 intègrent de par sont APU AMD Ryzen Zen2 ce type de faille, cela ne passerait que par un nouveau firmware proposé par Sony.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171911/in-ps5-de-nouvelles-vulnerabilites-decouvertes-dans-les-apu-ryzen-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] Nintendo va réparer gratuitement les Joy-Con même sans garantie",
        "content": "Enfin ! C'est un véritable miracle qui vient de se produire, Nintendo vient de faire l'une des annonces les plus importantes de ces dernières années, après probablement des milliers de plaintes sur les forums, sur les réseaux sociaux, de nombreux process intentés, voilà que Nintendo vient de reconnaitre enfin que ses Joy-cons sont victimes de drift. \n \n \n \n \n\n \n \n \nNintendo vient en effet d'annoncer la possibilité de réparer gratuitement les Joy-con défectueux, c'est à dire ceux qui ne répondent pas correctement ou ne fonctionnent pas (bug de réactivité du stick ou « drift »).\n \n \nLa page qui a été mise en place se trouve ici\n \n \n \nSi vous avez un minimum de personnes autour de vous qui disposent d'une Switch, il est impossible que vous ne trouviez pas quelqu'un qui n'a pas subit le phénomène, cela se caractérise par un mouvement incontrôlé, un viseur qui bouge, un personnage qui se déplace ou un véhicule qui finit dans le ravin sans raison, vous savez pourquoi.\n \nL'excellente vient aussi du fait que cela s'applique à tous les Joy-con qu'ils soient sous garantie ou qu'elle soit dépassée ! Voilà ce que Nintendo vient d'annoncer \"jusqu'à nouvel ordre pour les clients ayant acheté le produit en question dans l'EEE, le Royaume-Uni ou la Suisse, Nintendo se chargera de faire réparer gratuitement le stick de la manette Joy-Con dans un centre de réparation Nintendo officiel en cas de bug de réactivité de celui-ci. Cette offre est également valable en cas d'usure normale, même si la garantie constructeur de 24 mois de Nintendo est arrivée à expiration\".\n \n \n \n\n \n \n \nCette réparation implique une utilisation normale de la manette, pas une location, pas une utilisation commerciale ou \"si la manette a été ouverte, modifiée ou réparée par une personne ou entreprise autre que Nintendo ou ses partenaires agréés\".\n \nPour le moment, il est question des Switchs et Switch OLED, pas des SwitchLite, qui disposent de Joy-Con intégrés.\n \nUn superbe geste de la part de Nintendo, mais il était grand temps : nintendo.fr/Assistance/Nintendo-Switch/Depannage/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171859/in-switch-nintendo-va-reparer-gratuitement-les-joy-con-meme-sans-garantie-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1171859/in-switch-nintendo-va-reparer-gratuitement-les-joy-con-meme-sans-garantie-2.png"
        }
    },
    "news_11": {
        "title": "[Switch] uLaunch 0.3.5 disponible",
        "content": "Le développeur XorTroll dévoile une nouvelle moture de uLaunch qui passe en version 0.3.5, il faut dire que la dernière fois que cela a eu lie c'était il y a tout juste un an en Avril 2022.\n \nRappelons que uLaunch, déployé par XorTroll, est la ré-implémentation personnalisée et open source de qlaunch (le menu HOME de la console Switch). Orienté homebrew, ULaunch est simplement une ré-implémentation complète, 100% open-source, qui reprend également l'applet eShop, le contrôle parental et le titre du système de flagellation ( tous sont pratiquement inutiles avec cette ré-implémentation) pour sa fonctionnalité étendue.\n \n \n\n \n\n \n \n \nChangelog \n \nuLaunch : \n \n- Mise à jour pour la dernière version d'Atmosphere (v1.5.1) et libnx\n \n- Correction de la prise en charge de certains jeux, comme les titres Nintendo Switch Online\n \nuViewer : \n \n- Pas de changement (donc pas de binaires de nouvelle version)\n \n \nTéléchargement : uLaunch 0.3.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171856/in-switch-ulaunch-035-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1171856/in-switch-ulaunch-035-disponible-2.png"
        }
    },
    "news_12": {
        "title": "[PS4] Icon Mask 1.10 disponible",
        "content": "Le développeur Lapy vient de mettre en ligne une nouvelle version de son programme Icon Mask, pour rappel Icon Mask  permet de modifier l'apparence des icônes sur le dashboard de la PlayStation 4.\n \nIcon Mask est en effet une application Homebrew pour PS4 qui vous permet de modifier l'apparence de vos icônes, en leur appliquant un simple masque PNG. Cela vous permet de modifier la transparence, d'ajouter des bordures, d'afficher vos icônes dans une icône officielle \"PS4 box\"...\n \n \n\n \n \nCette version ajoute 4 nouveaux masques proposés par Anubis_Qz, et il a retravaillé le code afin de l'améliorer. \n \nTéléchargement : Icon Mask 1.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171850/in-ps4-icon-mask-109-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[PSP] Apollo Save Tool (PSP) 0.7.0 disponible",
        "content": "Le développeur Damián Parrino, Bucanero, apporte Apollo Save Tool à la console portable PSP, cette version spéciale taillée pour la PSP a été dédiée à son chienne de 12 ans, Luna, qu'il vient de perdre, à ce titre, nous tenons à apporter tout notre soutien à Bucanero.  \n \nRappelons que Apollo Save Tool a été à l'origine lancé sur la PlayStation 3, puis a suivi la version  PlayStation 4, ensuite la version Vita et donc désormais la PSP. \n \n \n\n \n \nRappelons pour la forme que Apollo Save Tool est une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PSP.\n \n \nChangelog : \n \nGestion des sauvegardes PSP\n- Importation et exportation de sauvegardes\n- Hashes PARAM.SFO\n- Correction des cheatscodes\n- Exportation au format .Zip\ndécryptage/chiffrage des données de sauvegarde (clé de jeu requise)\n- Option d'auto-installation du plugin Save-game Key dumper\nBase de données en ligne avec des sauvegardes PSP pour plus de 400 jeux\n- Code réseau utilisant libcurl avec support TLS 1.2\nMoteur de patch Apollo v0.4.1\n- Support des cheat codes de Save Wizard (Game Genie)\n- Support des scripts de triche Bruteforce Save data (BSD)\n- Inclut des patchs de triche pour les sauvegardes PSP\n- Outils divers : Extraction d'archives Zip, 7-Zip\nSignature de cartes mémoires VMP PS1\n- Exporter une carte mémoire VMP PS1 vers MCR\n- Importation de la PS1 memcard du MCR vers la VMP\n \n \nTéléchargement : Apollo Save Tool (PSP) 0.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171849/in-psp-apollo-save-tool-psp-070-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS4/PS5] CTurt dévoile la partie 2 de son writeup sur Mast1c0re",
        "content": "Le développeur CTurt prend sa retraite de tout ce qu'il a pu proposer en matière de hack, après avoir diffusé de nombreux articles récemment, compilé tout son travail et dévoilé de nombreux bugs au programme bounty de Sony, voilà qu'il vient de publier la partie 2 de son dossier sur Mast1c0re.\n \nDans un premier article le développeur avait expliqué comment Mast1c0re permettait d'exécuter du code PS2 nativement via une Toolchain ROP sur PS4/PS5, dans ce second article, il dévoile comment chacun des exploits dans le processus de compilation JIT de l'émulateur PS2 peuvent conduire à l'exécution de code natif sur la PS4/PS5. Pour y parvenir, CTurt présente 3 exploits dans le code du compilateur PS2 qui lui permettent d'obtenir l'exécution de code natif, ainsi que des techniques pour contourner l'ASLR. \n \nPour des raisons personnelles, CTurt n'a jamais finalisé l'exploit intégralement, ce qui laisse la porte ouverte aux autres développeurs pour apporter leur pierre à l'édifice. CTurt explique que l'exploit reste limité puisque \"Usermode\", mais il pourrait permettre l'arrivée des hombrews sur PS5. \n \nDans sa façon de fonctionner, l'exploit permet de charger jusqu'à 65 Mo, ce qui est déjà pas mal, mais cela impose aussi une limite qui a été introduite avec le firmware 6.00 de la PS5, et sur le firmware 10.00 sur PS4. \n \n \n\n \n \nLa conclusion de CTurt laisse de l'espoir tout en restant réaliste : \n \n \nIl y a de fortes chances qu'avec suffisamment de motivation, les vulnérabilités décrites dans ce billet puissent être exploitées pour prendre le contrôle du processus de compilation. L'exploit permettrait l'exécution de code arbitraire sur les derniers firmwares de la PS4 et de la PS5, ce qui permettrait d'exécuter des applications homebrew natives à partir d'un stockage USB. \n \nSony a mis en place des mesures pour limiter la taille des applications pouvant être exécutées, je pense toujours qu'il serait possible d'exécuter des applications plus importantes, bien qu'elles soient partiellement émulées ou paginées dynamiquement. \n \nCompte tenu de la quantité de travail nécessaire, je ne pense pas, de manière réaliste, que nous verrons des démos de Linux ou des jeux PS4 fonctionner, mais il est amusant de penser qu'il y a une bonne chance que théoriquement ces choses soient au moins techniquement possibles.\n \n \nL'article est disponible ici : mast1c0re-2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171842/in-ps4ps5-cturt-devoile-la-partie-2-de-son-writeup-sur-mast1c0re-1.png"
        }
    },
    "news_15": {
        "title": "[WiiU] Aroma Beta 14, Padcon Plugin Mod, Wii U Recovery Menu",
        "content": "Après les trop nombreux poissons d'avril que nous détestons tous, nous pouvons reprendre le cour classique de notre flux d'actualités en vous proposant ce qui a été fait de mieux ces dernières heures pour la Nintendo Wii U. \n \nNous commençons par du croustillant, avec le développeur Maschell qui vient de mettre à jour Aroma en version Bêta 14. Rappelons tout d'abord qu'Aroma est l'environnement homebrew pour la Wii U, il évolue une nouvelle fois avec de nouvelles options et corrections. \n \nL'ordre des menus est désormais enregistré dans un sous-dossier avec le numéro de série de la console, de sorte que la même carte SD peut être utilisée sans problème dans d'autres Wii U. Cela fonctionne maintenant aussi avec d'autres comptes sur la même console.\n \n \n\n \n \nUn bug a été corrigé où le compte correct n'était pas chargé lorsqu'une applet ou le menu Wii U était sélectionné dans le menu de démarrage rapide, et le chargement de disques à partir de ce menu a également été ajusté.\n \nCette mise à jour contient également le plugin Homebrew on Menu v1.0.6.\n \n \nTéléchargement : Aroma Beta 14\n \n \nPadcon Plugin Mod est une version modifiée du même plugin WUPS développé par Maschell qui permet d'éteindre l' écran du Wii U GamePad grâce à une combinaison de touches : ZL + ZR + L + R + Moins\n \n \n\n \n \nPour rallumer l'écran il suffit d'appuyer sur le bouton de démarrage. \n \nLes évolutions portent sur l'ajout d'un menu de configuration permettant de modifier les combinaisons de boutons (ouvrir avec \"L\" + \"D-Pad Down\" + \"Minus\")\n \n \nTéléchargement : Padcon Plugin Mod 2.0\n \n \nEnfin, Wii U Recovery Menu est désormais disponible en version 0.5, pour rappel, ce logiciel permet de récupérer une Wii U notamment lorsqu'on utilise mal Coldboot Haxchi. Avec cette nouvelle version, le développeur a fait évoluer l'interface en modifiant certains éléments du menu, il a également rajouté le support de la configuration des gamepads, qui peuvent désormais être couplés directement. A noter que le lecteur de disque ne tourne plus dans le menu et le voyant d'alimentation est désormais utilisé pour déboguer les problèmes lors du démarrage. \n \n \n\n \n \nChangelog :\n \n- Nouvelle fonction \"Submit System Data\" pour permettre de soumettre des consoles à la base de données système de la Wii U directement depuis le menu recovery_menu (Merci @GerbilSoft)\n- L'écran \"System Information\" affiche désormais la révision du BSP (Merci @GerbilSoft)\n- Le menu recovery_menu n'imprime plus un gros log ODM dans les logfiles suite à l'arrêt du lecteur de disque.\n \nTéléchargement : Wii U Recovery Menu 0.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171830/in-wiiu-aroma-beta-14-padcon-plugin-mod-wii-u-recovery-menu-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1171830/in-wiiu-aroma-beta-14-padcon-plugin-mod-wii-u-recovery-menu-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1171830/in-wiiu-aroma-beta-14-padcon-plugin-mod-wii-u-recovery-menu-1.png"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] Get IP PS5 Mast1c0re v1.0.0 et compatible PS4 10.01 et 10.50",
        "content": "Notre ami sunriseur, développeur et technicien Logic-68, déjà auteur de Backup-SAV-PS5, PFSMNT Dumper, Enable-Disable-UPD-PS5 et getOsVersion nous propose de découvrir son outil pour la PS4 et la PS5: Get IP PS5 Mast1c0re.\n \nCe nouveau payload, compatible avec l'exploit Mast1core, permettra d'afficher l'adresse IP sur l'écran de la PlayStation 5.\n \n\n \nA noter que la version PS4 supporte le firmware 10.01 et 10.50.\n \nTéléchargement : IP PS5 Mast1c0re v1.0.0 / IP PS5 Mast1c0re (PS4 FW 10.01-10.50)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171801/in-ps4ps5-get-ip-ps5-mast1c0re-v100-et-compatible-ps4-1001-et-1050-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS3] PS3HEN v3.2.1 disponible (4.83 - 4.90 HFW)",
        "content": "Les développeurs de la Team PS3Xploit viennent de mettre en ligne la version 3.2.1 de PS3HEN, il y a quelques semaines le firmware 4.90 sortait, Joonie et esc0rtd3w ont travaillé dur pour parvenir à sortir cette update. \n \nDans la mise à jour v3.2.1, il y a eu un certain nombre de modifications et un support supplémentaire pour Ps3HEN. Joonie a publié un backport de HFW (firmware hybride) pour le 4.83 , cela a été fait car Ps3HEN a fourni un support pour le firmware 4.83, en plus du firmware 4.84 DEX.\n \nCette version corrige en plus un bug wMM qui créait un problème de blocage dans la v3.2.0. voir les derniers journaux des modifications fournis ci-dessous.\n \n \n \n\n \n \n \n \nPs3HEN v3.2.1\nChangements globaux\n- Ajout de la prise en charge du firmware DEX 4.84\n- Mise à jour des ressources DEX et du stackframe (4.84 DEX/PEX uniquement) (merci @Joonie )\n- Ajout de la prise en charge du micrologiciel 4.83 (HFW) (merci @Joonie)\n- Ajout du support pour le firmware 4.82 (OFW)\n- Mise à jour du PS3HEN_GEN et ajout du fichier makefile (merci @bucanero )\nChangements dans l'installateur\n- Les octets seront écrits par webkit si HEN est chargé depuis HTML, ainsi HEN peut mettre le drapeau d'installation.\n- Ajout de la fonction downloadhenD() pour permettre le téléchargement du p3t DEX si la case DEX est cochée (4.82D/4.84D seulement)\nChangements dans le plugin HEN\n- Ajout d'une vérification pour webMAN-MOD, et si installé, téléchargera le paquet avec WMM inclus, seulement si HEN est en cours d'installation.\n- Mise à jour des offsets et des valeurs de peekq pour CEX/DEX lors du téléchargement des paquets.\nModifications du payload\n- Mise à jour de la version détectée de COBRA à 8.4\n- Mise à jour de PS3MAPI_CORE_VERSION à 1.24 (merci bucanero)\n- Ajout d'une vérification pour l'installation de HEN. Les fichiers texte des plugins de démarrage seront supprimés si HEN est exécuté à partir de l'installateur html.\n- Mise à jour de la liste noire des UMD/PSP et correction de l'espacement (merci @aldostools )\nChangements dans les ressources\n- Ajout d'un message VSH pour alerter les utilisateurs de la suppression du texte des plugins d'amorçage.\n- Mise à jour du message de bienvenue de HEN pour le mode développeur/version\n \n \nTéléchargement : PS3HEN_3.2.1_4.90_FW / PS3HEN\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171791/in-ps3-ps3hen-v321-disponible-483-490-hfw-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] CTurt a rapporté 5 nouvelles failles sur le bounty program PlayStation",
        "content": "Le développeur CTurt vient de voir pas moins de 5 vulnérabilités validées au programme bounty de PlayStation sur Hackerone.com.\n \n\n \nEn tout ce sont donc pas moins de 19 vulnérabilités qu'il a découvert en moins de 2 ans, et qui ont été reconnues et validées à 11 reprises. \n \n \n\n \n \nLa réputation de CTurt n'est plus à faire, il s'agit probablement d'exploit ou de failles importantes, surtout qu'il vient tout juste d'annoncer sa retraite du hack, serait-ce le chant du signe ? \n \nPour rappel tout son travail se trouve ici :  https://cturt.github.io/articles.html\n \nLa validation de ces 5 rapports laisserait entendre qu'il a rapporté à Sony 5 nouvelles failles ou exploits ces 2 à 3 derniers mois. \n \nTout est là  :  hackerone.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171752/in-ps5-cturt-a-rapporte-5-nouvelles-failles-sur-le-bounty-program-playstation-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1171752/in-ps5-cturt-a-rapporte-5-nouvelles-failles-sur-le-bounty-program-playstation-2.png"
        }
    },
    "news_19": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v25.9.0 et nds-bootstrap v0.71.0",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v25.9.0 et 0.71.0. TWiLightMenu++ pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \n\nChangelog TWiLight Menu++ v25.9.0 : \n \nAméliorations\n- DeadSkullzJr : Ajout d'un correctif AP pour Pokémon : Version Argent Apaisé (v1.3.0)\n- DeadSkullzJr : Ajout d'un AP-fix pour Pokemon : StormSilver Version (v1.10)\n- icup321 : Ajout du patch pour l'écran large de Rayman Raving Rabbids (#2169)\n- Pour recréer plus fidèlement l'apparence et la sensation, les thèmes DSi & 3DS s'affichent maintenant en fondu après le chargement de la page de jeux en cours.\n- Augmentation de la limite de fichiers/dossiers de 320 à 512 (Flashcard) ou 1024 (DSi/3DS).\n- PW5190 : Ajout des classifications ESRB pour plus de jeux DS (#2175)\n- Changement du paramètre Use nds-bootstrap en Game Loader sur les flashcards.\n- Le paramètre par défaut est nds-bootstrap.\n \nAmélioration\n- Epicpkmn11 et divers : Mise à jour des traductions.\n \nCorrection de bugs\n- Pour éviter des problèmes étranges, TWLMenu++ ne démarre plus avec une carte SD verrouillée en écriture.\n- argv n'est plus passé à Unlaunch.dsi, dans l'espoir de corriger le bug où il ne démarre pas pour certains utilisateurs.\n- Correction de sd:/hiya.dsi n'étant pas détecté, pour essayer d'ouvrir System Settings ou le DSi Menu.\n- Correction du DSiWare lancé depuis une carte flash ne démarrant pas via nds-bootstrap lorsqu'il est copié dans un emplacement temporaire sur la carte SD.\n- DieGo367 : Correction des icônes/bannières personnalisées sur les fichiers argv (#2166, #2167)\n- Correction d'un bug de longue date où le lancement de Pictochat ou DLP en utilisant le DS Classic Menu ne fonctionne pas parfois.\n- DieGo367 : Ajout de vérifications des limites pour les tirages de polices datetime/username (#2173)\n- DieGo367 : Correction d'un crash lié aux polices (#2163)\n- Si une couleur utilisateur/favorite invalide est détectée dans la puce FW, le gris est maintenant utilisé par défaut (ou le rouge pour l'écran d'accueil TWLMenu++).\n- Retour à la version FastVideoDSPlayer avec vérification TWL WRAM pour permettre la lecture vidéo lors de l'utilisation de Memory Pit.\n \n \nChangelog nds-bootstrap v0.71.0 : \n \nAméliorations\n- Mode B4DS : Castle Conqueror : Heroes 2 n'a plus besoin d'un Memory Expansion Pak pour fonctionner !\n- Epicpkmn11 et divers : Mise à jour des traductions des menus du jeu.\n- Quelques optimisations mineures du code.\n \nCorrections de bugs (DSi/3DS)\n- Les fans de Fossil Fighters n'auront plus à attendre ni à s'inquiéter, car Fossil Fighters Champions démarre à nouveau !\n- Par conséquent, d'autres ROM THUMB améliorées pour DSi, telles que Bejeweled Twist, redémarrent également.\n- Le réglage de l'emplacement SDNAND/Photo devrait maintenant fonctionner correctement.\n- Il ne tentera plus de monter la SysNAND actuelle, si une SDNAND est trouvée.\n- Seuls les périphériques nécessaires sont ajoutés à la liste des périphériques pour DSiWare.\n- Cela devrait permettre de résoudre quelques problèmes étranges liés aux sauvegardes avec certains d'entre eux.\n- Starship Defense & Trajectile démarrent maintenant via Memory Pit.\n- Correction de Panewa ! qui ne démarre pas.\n- Correction de Super Smash Bros. Crash ne passant pas d'un menu à l'autre.\n \nTitres DSiWare désormais pris en charge sur DS et DS lite : \n- Les titres marqués en italique nécessitent un Memory Expansion Pak ou une console de débogage. (la liste est dans le lien ci-dessous)\n- Les titres marqués en gras ne démarreront que sur les consoles de débogage (la liste est dans le lien ci-dessous)\n \n \nTéléchargement : TWiLight Menu++ v25.9.0 / nds-bootstrap v0.71.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171741/in-2ds3dsds-twilight-menu-v2590-et-nds-bootstrap-v0710-1.png"
        }
    },
    "news_20": {
        "title": "[PS4/PS5] PS-PSH: un serveur Shell pour PS4/PS5",
        "content": "Il y a quelques jours, le développeur Aladie a publié PS-PSH 0.0.1 sur Github, un serveur Shell primitif pour les consoles PS4 et PS5 utilisant l'exploit Mast1c0re PS2.\n \n\n \nEn effet, grâce à ce nouvel utilitaire qui passe en version 0.1.1, il vous sera possible d'envoyer ou de récupérer des fichiers dans la sandbox de vos PS4/PS5. Malheureusement, il n'est pas encore possible d'écrire dans certains dossiers dans cette dernière (pour l instant).\n \nVous pourrez entre autre, dumper (un à un) tous les fichiers de la sandbox, envoyer des fichiers dans les dossiers /av_contents/content_tmp/ et /temp0/..., copier/déplacer, créer des dossiers ou encore lancer des .iso depuis la sandbox de vos consoles.\n \nCitation de l' auteur:\n \n\n\nYou cannot write to all folders in the sandbox. -> Known and working: /av_contents/content_tmp/ and /temp0/.\n\"/temp0/\" will also store the files after a reboot/restart of OKAGE and/or the PS4/PS5. Not 100% sure you have to test for yourself\nAfter downloading/uploading a file and directly trying to download/upload another file can fail. -> Workaround: wait a couple of seconds\nThe server can crash after resending/restarting the server after exiting the server with the exit command -> Workaround: reopen OKAGE\n\n\n \nTélécharger PS-PSH v0.1.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1171732/in-ps5-ps-psh-un-serveur-shell-pour-ps4ps5-1.png"
        }
    }
}